notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.org
#+TITLE: keras in tensorflow
#+AUTHOR: stupid-coder
#+EMAIL: stupid_coder@163.com
#+OPTIONS: num:nil H:2
#+STARTUP: indent


原文来自：[[https://www.tensorflow.org/guide/keras][Keras in Tensorflow]]。

=Keras= 是一个深度学习框架前端，实现了更为友好的高级接口。从而可以更容易理解和更
容易开发。 =Keras= 具有如下三个优点：

+ =User friendly= :: 提供了更为简单和统一的接口，提供了更为干净和可追溯的错误信
     息。
+ =Modular and composable= :: 整个 keras 的构建都是基于模块化，很容易通过将多个模
     块组合在一起实现更为通用的模型。
+ =Easy to extend= :: 模块接口定义清除，只需要实现对应的模块就可以实现整个框架能
     力的扩展。

* 使用指南

  *[[https://www.tensorflow.org/api_docs/python/tf/keras][tf.keras]]* 现在为 =TensorFlow= 内置的构建库，非常容易使用。基本使用的流程为：1.
  引入 =keras= 库；2. 构建模型；3. 训练和评估模型。

  其中模型构建， =keras= 提供两种模型构建方式：序列模型和函数模型。序列模型构建
  较为简单，但是构建的模型结构较为单一。函数模型可以构建更为复杂的模型，但是需要
  采取更为繁琐的构建过程。

  本文先介绍如何在 =tensorflow= 中引入 =keras= ，然后介绍如何构建序列模型和模型
  的训练评估；然后介绍如何构建函数模型；介绍其他功能，例如模型训练过程中可以采取
  的一些回调操作，模型的保存和回复等等功能。

** 引入 tf.keras
   =tf.keras= 为 =TensorFlow= 兼容 [[https://keras.io/][=Keras API sepcification]]= 的实现，并且支持
   =TensorFlow= 中包括 [[https://www.tensorflow.org/guide/keras#eager_execution][eager execution]], [[https://www.tensorflow.org/api_docs/python/tf/data][tf.data pipelines]] 和 [[https://www.tensorflow.org/guide/estimators][estimators]] 等功能。
   
   #+BEGIN_SRC python
     import tensorflow as  tf
     from tensorflow import keras
   #+END_SRC

   =tf.keras= 基本和原生的 =keras= 一致，但是需要记住：
   + 由于 tf.keras 是随着 tensorflow 发布，所以和最新版的原生的 keras 可能有一些
     不一致。
   + 在保存模型权值，tf.keras 默认采取 [[https://www.tensorflow.org/guide/checkpoints][checkpoint format]]； 通过传入
     save_format='h5'，使用和 keras 一致的 HDF5。
     
   
** 序列模型
   keras 采取通过组合网络层的形式来构建模型。最常见的神经网络模型是不同网络的堆
   叠，可以采取 =tf.keras.Sequential= 学列模型来构建。

   一个简单的全链接网络：
   #+BEGIN_SRC python
     model = keras.Sequential()
     # 添加一个全链接网络层，具有 64 个神经元
     model.add(keras.layers.Dense(64, activation='relu'))
     model.add(keras.layers.Dense(64, activation='relu'))
     # 添加一个 softmax 网络层，具有 10 个输出神经元
     model.add(keras.layers.Dense(10, activation='softmax'))
   #+END_SRC

*** 配置网络层
    keras 具有多种类型的网络层，具体可以参看 [[https://www.tensorflow.org/api_docs/python/tf/keras/layers][keras.layers]] ，网络层都具有如下构造
    参数：
    + =activation= :: 设置网络的激活函数，该参数可以是内置激活函数的字符串名称，或
                      者为一个可调用函数。
    + =kerel_initializer= 和 =bias_initializer= :: 权值和偏置的初始化策略，该参
         数可以为对应策略的字符串名称，或者是一个可调用函数。默认为 /Glorot
         uniform/ 初始化策略。
    + =kernel_regularizer= 和 =bias_regularizer= :: 权值和偏置的正则化策略。
         
         
    如下是采取了不同初始化参数的全链接层：
    #+BEGIN_SRC python
      # 构建 sigmoid 作为激活函数的全链接层
      layers.Dense(64, activation='sigmoid')
      # or:
      layers.Dense(64, activation=tf.keras.activations.sigmoid)

      # 权值采取 L1 正则的全链接层
      layers.Dense(64, kernel_regularizer=tf.keras.regularizers.l1(0.01))
      # 偏置采取 L2 正则的全链接层
      layers.Dense(64, bias_regularizer=tf.keras.regularizers.l2(0.01))

      # 权值采取随机正交初始化的全链接层
      layers.Dense(64, kernel_initializer='orthogonal')
      # 偏置设置为 2.0 的全链接层
      layers.Dense(64, bias_intializer=keras.initializers.constant(2.0))
    #+END_SRC
        
** 模型训练
   模型构建完成之后，可以通过调用模型的 =compile= 方法来配置训练过程：
   #+BEGIN_SRC python
     model.compile(optimizer=tf.keras.optimizers.Adam(),
                   loss=tf.keras.losses.categorical_crossentropy,
                   metrics=['accuracy'])
   #+END_SRC
   
   [[https://www.tensorflow.org/api_docs/python/tf/keras/Model#compile][tf.keras.Model.compile]] 接受三个最重要的参数：
   + =optimizer= :: 执行训练中采用的优化策略。例如：AdamOptimizer,
                    RMSPPropOptimizer，或者 GradientDescentOptimizer。可以是对应
                    的优化策略名字的字符串或者是 tf.keras.optimizers 模块下的可调
                    用对象
   + =loss= :: 损失函数，损失函数可以是对应的函数名字符串或者是 tf.keras.losses 模
               块下的可调用的对象。
   + =metrics= :: 训练过程中需要监控的指标。可以是对于的字符串，或者是
                  tf.keras.metrics 模块下的可调用对象。


   如下是一些模型训练配置的例子：
   #+BEGIN_SRC python
     # 采取均值方差作为损失函数的回归模型
     model.compile(optimizer=tf.keras.optimizers.Adam(0.01),
                   loss='mse', # mean squared error
                   metrics=['mae']) # mean absolute error

     # 采取分类交叉熵的分类模型
     model.compile(optimizer=tf.keras.optimizers.RMSProp(0.01),
                   loss=tf.keras.categorical_crossentropy,
                   metrics=[keras.metrics.categorical_accuracy])
   #+END_SRC


   模型训练过程配置完成后，就可以开始训练了，通过调用模型的 =fit= 方法调用训练过
   程。 =fit= 方法除了可以接受 =numpy= 作为输入，也可以采用 =tf.data= 作为输入。

