publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>keras in tensorflow</title>
<!-- 2018-09-25 Tue 23:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="stupid-coder" />
<link rel="stylesheet" title="Standard" href="/assets/worg.css" type="text/css" />
           <link rel="alternate stylesheet" title="Zenburn" href="/assets/worg-zenburn.css" type="text/css" />
           <link rel="alternate stylesheet" title="Classic" href="/assets/worg-classic.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">keras in tensorflow</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">使用指南</a>
<ul>
<li><a href="#sec-1-1">引入 tf.keras</a></li>
<li><a href="#sec-1-2">序列模型</a></li>
<li><a href="#sec-1-3">模型训练</a></li>
<li><a href="#sec-1-4">模型评估和预测</a></li>
<li><a href="#sec-1-5">函数模型</a></li>
<li><a href="#sec-1-6">模型继承</a></li>
<li><a href="#sec-1-7">网络层适配</a></li>
<li><a href="#sec-1-8">回调方法</a></li>
<li><a href="#sec-1-9">模型的保存和加载</a></li>
<li><a href="#sec-1-10">立即执行模式</a></li>
<li><a href="#sec-1-11">分布式</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
原文来自：<a href="https://www.tensorflow.org/guide/keras">Keras in Tensorflow</a>。
</p>

<p>
<code>Keras</code> 是一个深度学习框架前端，实现了更为友好的高级接口。从而可以更容易理解和更
容易开发。 <code>Keras</code> 具有如下三个优点：
</p>

<dl class="org-dl">
<dt> <code>User friendly</code> </dt><dd>提供了更为简单和统一的接口，提供了更为干净和可追溯的错误信
息。
</dd>
<dt> <code>Modular and composable</code> </dt><dd>整个 keras 的构建都是基于模块化，很容易通过将多个模
块组合在一起实现更为通用的模型。
</dd>
<dt> <code>Easy to extend</code> </dt><dd>模块接口定义清除，只需要实现对应的模块就可以实现整个框架能
力的扩展。
</dd>
</dl>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">使用指南</h2>
<div class="outline-text-2" id="text-1">
<p>
<b><a href="https://www.tensorflow.org/api_docs/python/tf/keras">tf.keras</a></b> 现在为 <code>TensorFlow</code> 内置的构建库，非常容易使用。基本使用的流程为：1.
引入 <code>keras</code> 库；2. 构建模型；3. 训练和评估模型。
</p>

<p>
其中模型构建， <code>keras</code> 提供两种模型构建方式：序列模型和函数模型。序列模型构建
较为简单，但是构建的模型结构较为单一。函数模型可以构建更为复杂的模型，但是需要
采取更为繁琐的构建过程。
</p>

<p>
本文先介绍如何在 <code>tensorflow</code> 中引入 <code>keras</code> ，然后介绍如何构建序列模型和模型
的训练评估；然后介绍如何构建函数模型；介绍其他功能，例如模型训练过程中可以采取
的一些回调操作，模型的保存和回复等等功能。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">引入 tf.keras</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>tf.keras</code> 为 <code>TensorFlow</code> 兼容 <a href="https://keras.io/">=Keras API sepcification</a>= 的实现，并且支持
<code>TensorFlow</code> 中包括 <a href="https://www.tensorflow.org/guide/keras#eager_execution">eager execution</a>, <a href="https://www.tensorflow.org/api_docs/python/tf/data">tf.data pipelines</a> 和 <a href="https://www.tensorflow.org/guide/estimators">estimators</a> 等功能。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">import</span> tensorflow <span style="color: #00bfff; font-weight: bold;">as</span>  tf
<span style="color: #00bfff; font-weight: bold;">from</span> tensorflow <span style="color: #00bfff; font-weight: bold;">import</span> keras
</pre>
</div>

<p>
<code>tf.keras</code> 基本和原生的 <code>keras</code> 一致，但是需要记住：
</p>
<ul class="org-ul">
<li>由于 tf.keras 是随着 tensorflow 发布，所以和最新版的原生的 keras 可能有一些
不一致。
</li>
<li>在保存模型权值，tf.keras 默认采取 <a href="https://www.tensorflow.org/guide/checkpoints">checkpoint format</a>； 通过传入
save_format='h5'，使用和 keras 一致的 HDF5。
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">序列模型</h3>
<div class="outline-text-3" id="text-1-2">
<p>
keras 采取通过组合网络层的形式来构建模型。最常见的神经网络模型是不同网络的堆
叠，可以采取 <code>tf.keras.Sequential</code> 学列模型来构建。
</p>

<p>
一个简单的全链接网络：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">model</span> = keras.Sequential()
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#28155;&#21152;&#19968;&#20010;&#20840;&#38142;&#25509;&#32593;&#32476;&#23618;&#65292;&#20855;&#26377; 64 &#20010;&#31070;&#32463;&#20803;</span>
model.add(keras.layers.Dense(64, activation=<span style="color: #daa520; font-style: italic;">'relu'</span>))
model.add(keras.layers.Dense(64, activation=<span style="color: #daa520; font-style: italic;">'relu'</span>))
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#28155;&#21152;&#19968;&#20010; softmax &#32593;&#32476;&#23618;&#65292;&#20855;&#26377; 10 &#20010;&#36755;&#20986;&#31070;&#32463;&#20803;</span>
model.add(keras.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'softmax'</span>))
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="sec-1-2-1" name="sec-1-2-1"></a>配置网络层<br  /><div class="outline-text-4" id="text-1-2-1">
<p>
keras 具有多种类型的网络层，具体可以参看 <a href="https://www.tensorflow.org/api_docs/python/tf/keras/layers">keras.layers</a> ，网络层都具有如下构造
参数：
</p>
<dl class="org-dl">
<dt> <code>activation</code> </dt><dd>设置网络的激活函数，该参数可以是内置激活函数的字符串名称，或
者为一个可调用函数。
</dd>
<dt> <code>kerel_initializer</code> 和 <code>bias_initializer</code> </dt><dd>权值和偏置的初始化策略，该参
数可以为对应策略的字符串名称，或者是一个可调用函数。默认为 <i>Glorot
uniform</i> 初始化策略。
</dd>
<dt> <code>kernel_regularizer</code> 和 <code>bias_regularizer</code> </dt><dd>权值和偏置的正则化策略。
</dd>
</dl>


<p>
如下是采取了不同初始化参数的全链接层：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26500;&#24314; sigmoid &#20316;&#20026;&#28608;&#27963;&#20989;&#25968;&#30340;&#20840;&#38142;&#25509;&#23618;</span>
layers.Dense(64, activation=<span style="color: #daa520; font-style: italic;">'sigmoid'</span>)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">or:</span>
layers.Dense(64, activation=tf.keras.activations.sigmoid)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26435;&#20540;&#37319;&#21462; L1 &#27491;&#21017;&#30340;&#20840;&#38142;&#25509;&#23618;</span>
layers.Dense(64, kernel_regularizer=tf.keras.regularizers.l1(0.01))
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20559;&#32622;&#37319;&#21462; L2 &#27491;&#21017;&#30340;&#20840;&#38142;&#25509;&#23618;</span>
layers.Dense(64, bias_regularizer=tf.keras.regularizers.l2(0.01))

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26435;&#20540;&#37319;&#21462;&#38543;&#26426;&#27491;&#20132;&#21021;&#22987;&#21270;&#30340;&#20840;&#38142;&#25509;&#23618;</span>
layers.Dense(64, kernel_initializer=<span style="color: #daa520; font-style: italic;">'orthogonal'</span>)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20559;&#32622;&#35774;&#32622;&#20026; 2.0 &#30340;&#20840;&#38142;&#25509;&#23618;</span>
layers.Dense(64, bias_intializer=keras.initializers.constant(2.0))
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">模型训练</h3>
<div class="outline-text-3" id="text-1-3">
<p>
模型构建完成之后，可以通过调用模型的 <code>compile</code> 方法来配置训练过程：
</p>
<div class="org-src-container">

<pre class="src src-python">model.<span style="font-weight: bold;">compile</span>(optimizer=tf.keras.optimizers.Adam(),
              loss=tf.keras.losses.categorical_crossentropy,
              metrics=[<span style="color: #daa520; font-style: italic;">'accuracy'</span>])
</pre>
</div>

<p>
<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model#compile">tf.keras.Model.compile</a> 接受三个最重要的参数：
</p>
<dl class="org-dl">
<dt> <code>optimizer</code> </dt><dd>执行训练中采用的优化策略。例如：AdamOptimizer,
RMSPPropOptimizer，或者 GradientDescentOptimizer。可以是对应
的优化策略名字的字符串或者是 tf.keras.optimizers 模块下的可调
用对象
</dd>
<dt> <code>loss</code> </dt><dd>损失函数，损失函数可以是对应的函数名字符串或者是 tf.keras.losses 模
块下的可调用的对象。
</dd>
<dt> <code>metrics</code> </dt><dd>训练过程中需要监控的指标。可以是对于的字符串，或者是
tf.keras.metrics 模块下的可调用对象。
</dd>
</dl>


<p>
如下是一些模型训练配置的例子：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#37319;&#21462;&#22343;&#20540;&#26041;&#24046;&#20316;&#20026;&#25439;&#22833;&#20989;&#25968;&#30340;&#22238;&#24402;&#27169;&#22411;</span>
model.<span style="font-weight: bold;">compile</span>(optimizer=tf.keras.optimizers.Adam(0.01),
              loss=<span style="color: #daa520; font-style: italic;">'mse'</span>, <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">mean squared error</span>
              metrics=[<span style="color: #daa520; font-style: italic;">'mae'</span>]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">mean absolute error</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#37319;&#21462;&#20998;&#31867;&#20132;&#21449;&#29109;&#30340;&#20998;&#31867;&#27169;&#22411;</span>
model.<span style="font-weight: bold;">compile</span>(optimizer=tf.keras.optimizers.RMSProp(0.01),
              loss=tf.keras.categorical_crossentropy,
              metrics=[keras.metrics.categorical_accuracy])
</pre>
</div>


<p>
模型训练过程配置完成后，就可以开始训练了，通过调用模型的 <code>fit</code> 方法调用训练过
程。 <code>fit</code> 方法除了可以接受 <code>numpy</code> 作为输入，也可以采用 <code>tf.data</code> 作为输入。
</p>
</div>

<ul class="org-ul"><li><a id="sec-1-3-1" name="sec-1-3-1"></a>NumPy 作为输入<br  /><div class="outline-text-4" id="text-1-3-1">
<p>
