notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.org
*** NumPy 作为输入
    对于小规模数据集，可以采用 NumPy 数组作为输入格式来训练和评估模型。

    #+BEGIN_SRC python
      import numpy as np

      data = np.random.random((1000, 32))
      labels = np.random.random((1000, 10))

      model.fit(data, labels, epochs=10, batch_size=32)
    #+END_SRC

    [[https://www.tensorflow.org/api_docs/python/tf/keras/Model#fit][tf.keras.Model.fit]] 方法接受三个最重要的参数：
    + =epochs= :: 迭代全数据集多少轮。
    + =batch_size= :: 模型会将输入的数据切分成很多小的批次，然后以批次为单位进行
                      训练和评估。该参数用来指定批次大小。
    + =validation_data= :: 训练过程中，可以输入验证集来监控模型训练过程中的一些
         指标。在每个 epoch 完成后，模型都会在验证集上计算对应的损失和指标。


    如下是一个加入验证集的例子：
    #+BEGIN_SRC python
      import numpy as np

      data =np.random.random((1000, 32))
      labels = np.random.random((1000, 10))

      val_data = np.random.random((100, 32))
      val_labels = np.random.random((100, 10))

      model.fit(data, labels, epochs=10, batch_size=32,
                validation_data=(val_data, val_labels))
    #+END_SRC

*** tf.data 作为输入
    在面对大规模的数据集，显然 NumPy 将全部数据存入内存的做法就不太适用。这时，
    可以采用 [[https://www.tensorflow.org/guide/datasets][Datasets API]] 来作为输入。 =fit= 方法可以接受 [[https://www.tensorflow.org/api_docs/python/tf/data/Dataset][tf.data.Dataset]] 对象作
    为参数：
    #+BEGIN_SRC python
      # 一个 Dataset 的简单例子
      dataset = tf.data.Dataset.from_tensor_slices((data, labels))
      dataset = dataset.batch(32)
      dataset = dataset.repeat()

      # 在调用 fit 方法时候，需要指定 steps_per_epoch 来指示 fit 采取的是 dataset 作为输入。
      model.fit(dataset, epochs=10, steps_per_epoch=30)
    #+END_SRC

    因为 /Dataset/ 自己已经指定了 /batch_size/， 所以 =fit= 方法使用
    /steps_per_epoch/ 参数控制多少次训练为一个 /epoch/ 。

    /Dataset/ 同样可以用作验证集：
    #+BEGIN_SRC python
      dataset = tf.data.Dataset.from_tensor_slices((data, labels))
      dataset = dataset.batch(32).repeat()

      val_dataset = tf.data.Dataset.from_tensor_slices((val_data, val_labels))
      val_dataset = val_dataset.batch(32).repeat()

      model.fit(dataset, epochs=10, steps_per_epoch=30,
                validation_data=val_dataset,
                validation_stesp=3)
    #+END_SRC
    
** 模型评估和预测
[[https://www.tensorflow.org/api_docs/python/tf/keras/Model#evaluate][tf.keras.Model.evaluate]] 方法用来做模型评估。[[https://www.tensorflow.org/api_docs/python/tf/keras/Model#predict][tf.keras.Model.predict]] 方法用来做模
型预测。

上述两个方法都可以接受 NumPy 和 tf.data.Dataset 作为输入。

#+BEGIN_SRC python
  # NumPy 作为输入，指定批次大小
  model.evaluate(x, y, batch_size=32)
  # Dataset 作为输入，需要指定 steps 表示评估执行多少步
  model.evaluate(dataset, steps=30)

  # NumPy 作为输入，指定批次大小
  model.predict(x, batch_size=32)
  # Dataset 作为输入，指定步长
  model.predicate(dataset, steps=30)
#+END_SRC
** 函数模型
=tf.keras.Sequential= 通过简单的堆叠网络层构建模型，这种方法无法构建更为复杂的模
型。可以采取 [[https://keras.io/getting-started/functional-api-guide/][Keras Functional API]]来构建更为复杂的网络拓扑结构：
+ 多路输入模型
+ 多路输出模型
+ 共享网络层
+ 模型具有残存链接


函数模型中，网络层可以看作是接受一个 Tensor 输入，返回一个 Tensor 的函数，通过调用这
些网络层函数构建网络拓扑结构。然后使用输入和输出张量定义模型。

如下为采取函数接口构建一个全链接的网络：
#+BEGIN_SRC python
  inputs = keras.Input(shape=(32,)) # 返回一个占位张量(placeholder tensor)

  # 网络层接受 Tensor 作为输入，返回一个 Tensor
  x = tf.keras.layers.Dense(64, activation='relu')(inputs)
  x = tf.keras.layers.Dense(64, activation='relu')(x)
  predictions = tf.keras.layers.Dense(10, activation='softmax')(x)

  # 使用输入和输出来构建模型对象
  model = tf.keras.Model(inputs=inputs, outputs=predictions)

  # 配置训练过程
  model.compile(optimizer=tf.keras.optimizers.RMSProp(0.001),
                loss=tf.keras.losses.categorical_crossentropy,
                metrics=['accuracy'])

  # 训练 5 轮
  model.fit(data, labels, batch_size=32, epochs=5)
#+END_SRC
** 模型继承
除了上述两种模型构建方法，也可以通过继承[[https://www.tensorflow.org/api_docs/python/tf/keras/Model][tf.keras.Model]]，实现前向传播方法来构建模
型。在 =__init__= 方法中创建网络层，然后设置为模型属性。然后在 =call= 方法中定义
前向传播。

模型继承构建模型的方法在采用[[https://www.tensorflow.org/guide/eager][eager execution]]模式时非常有用。

如下为采取继承的方法构建一个全链接网络：
#+BEGIN_SRC pythond 
  class MyModel(tf.keras.Model):
      def __init__(self, num_classes=10):
          super(MyModel, self).__init__(name='my_model')
          self.num_classes = num_classes
          # 定义网络层
          self.dense_1 = tf.keras.layers.Dense(32, activation='relu')
          self.dense_2 = tf.keras.layers.Dense(num_classes, activation='sigmoid')

      def call(self, inputs):
          # 采取__init__中定义的网络层来定义前向传播
          x = self.dense_1(inputs)
          return self.dense_2(x)

      def compute_output_shape(self, input_shape):
          # 如果该模型需要作为函数模型的一部分，那么需要定义该方法
          shape = tf.TensorShape(input_shape).as_list()
          shape[-1] = self.num_classes
          return tf.TensorShape(shape)

      # 实例化模型
      model = MyModel(num_classes=10)

      # 配置训练过程
      model.compile(optimizer=tf.keras.optimizers.RMSProp(0.001),
                    loss=tf.keras.categorical_crossentropy,
                    metrics=['accuracy'])

      # 训练 5 轮
      model.fit(data, labels, batch_size=32, epochs=5)
#+END_SRC
