publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.html
对于小规模数据集，可以采用 NumPy 数组作为输入格式来训练和评估模型。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">import</span> numpy <span style="color: #00bfff; font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">data</span> = np.random.random((1000, 32))
<span style="font-weight: bold; font-style: italic;">labels</span> = np.random.random((1000, 10))

model.fit(data, labels, epochs=10, batch_size=32)
</pre>
</div>

<p>
<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model#fit">tf.keras.Model.fit</a> 方法接受三个最重要的参数：
</p>
<dl class="org-dl">
<dt> <code>epochs</code> </dt><dd>迭代全数据集多少轮。
</dd>
<dt> <code>batch_size</code> </dt><dd>模型会将输入的数据切分成很多小的批次，然后以批次为单位进行
训练和评估。该参数用来指定批次大小。
</dd>
<dt> <code>validation_data</code> </dt><dd>训练过程中，可以输入验证集来监控模型训练过程中的一些
指标。在每个 epoch 完成后，模型都会在验证集上计算对应的损失和指标。
</dd>
</dl>


<p>
如下是一个加入验证集的例子：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">import</span> numpy <span style="color: #00bfff; font-weight: bold;">as</span> np

<span style="font-weight: bold; font-style: italic;">data</span> =np.random.random((1000, 32))
<span style="font-weight: bold; font-style: italic;">labels</span> = np.random.random((1000, 10))

<span style="font-weight: bold; font-style: italic;">val_data</span> = np.random.random((100, 32))
<span style="font-weight: bold; font-style: italic;">val_labels</span> = np.random.random((100, 10))

model.fit(data, labels, epochs=10, batch_size=32,
          validation_data=(val_data, val_labels))
</pre>
</div>
</div>
</li>

<li><a id="sec-1-3-2" name="sec-1-3-2"></a>tf.data 作为输入<br  /><div class="outline-text-4" id="text-1-3-2">
<p>
在面对大规模的数据集，显然 NumPy 将全部数据存入内存的做法就不太适用。这时，
可以采用 <a href="https://www.tensorflow.org/guide/datasets">Datasets API</a> 来作为输入。 <code>fit</code> 方法可以接受 <a href="https://www.tensorflow.org/api_docs/python/tf/data/Dataset">tf.data.Dataset</a> 对象作
为参数：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#19968;&#20010; Dataset &#30340;&#31616;&#21333;&#20363;&#23376;</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((data, labels))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#22312;&#35843;&#29992; fit &#26041;&#27861;&#26102;&#20505;&#65292;&#38656;&#35201;&#25351;&#23450; steps_per_epoch &#26469;&#25351;&#31034; fit &#37319;&#21462;&#30340;&#26159; dataset &#20316;&#20026;&#36755;&#20837;&#12290;</span>
model.fit(dataset, epochs=10, steps_per_epoch=30)
</pre>
</div>

<p>
因为 <i>Dataset</i> 自己已经指定了 <i>batch_size/， 所以 <code>fit</code> 方法使用
/steps_per_epoch</i> 参数控制多少次训练为一个 <i>epoch</i> 。
</p>

<p>
<i>Dataset</i> 同样可以用作验证集：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((data, labels))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32).repeat()

<span style="font-weight: bold; font-style: italic;">val_dataset</span> = tf.data.Dataset.from_tensor_slices((val_data, val_labels))
<span style="font-weight: bold; font-style: italic;">val_dataset</span> = val_dataset.batch(32).repeat()

model.fit(dataset, epochs=10, steps_per_epoch=30,
          validation_data=val_dataset,
          validation_stesp=3)
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">模型评估和预测</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model#evaluate">tf.keras.Model.evaluate</a> 方法用来做模型评估。<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model#predict">tf.keras.Model.predict</a> 方法用来做模
型预测。
</p>

<p>
上述两个方法都可以接受 NumPy 和 tf.data.Dataset 作为输入。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">NumPy &#20316;&#20026;&#36755;&#20837;&#65292;&#25351;&#23450;&#25209;&#27425;&#22823;&#23567;</span>
model.evaluate(x, y, batch_size=32)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Dataset &#20316;&#20026;&#36755;&#20837;&#65292;&#38656;&#35201;&#25351;&#23450; steps &#34920;&#31034;&#35780;&#20272;&#25191;&#34892;&#22810;&#23569;&#27493;</span>
model.evaluate(dataset, steps=30)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">NumPy &#20316;&#20026;&#36755;&#20837;&#65292;&#25351;&#23450;&#25209;&#27425;&#22823;&#23567;</span>
model.predict(x, batch_size=32)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Dataset &#20316;&#20026;&#36755;&#20837;&#65292;&#25351;&#23450;&#27493;&#38271;</span>
model.predicate(dataset, steps=30)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">函数模型</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>tf.keras.Sequential</code> 通过简单的堆叠网络层构建模型，这种方法无法构建更为复杂的模
型。可以采取 <a href="https://keras.io/getting-started/functional-api-guide/">Keras Functional API</a>来构建更为复杂的网络拓扑结构：
</p>
<ul class="org-ul">
<li>多路输入模型
</li>
<li>多路输出模型
</li>
<li>共享网络层
</li>
<li>模型具有残存链接
</li>
</ul>


<p>
函数模型中，网络层可以看作是接受一个 Tensor 输入，返回一个 Tensor 的函数，通过调用这
些网络层函数构建网络拓扑结构。然后使用输入和输出张量定义模型。
</p>

<p>
如下为采取函数接口构建一个全链接的网络：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">inputs</span> = keras.Input(shape=(32,)) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36820;&#22238;&#19968;&#20010;&#21344;&#20301;&#24352;&#37327;(placeholder tensor)</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#32593;&#32476;&#23618;&#25509;&#21463; Tensor &#20316;&#20026;&#36755;&#20837;&#65292;&#36820;&#22238;&#19968;&#20010; Tensor</span>
<span style="font-weight: bold; font-style: italic;">x</span> = tf.keras.layers.Dense(64, activation=<span style="color: #daa520; font-style: italic;">'relu'</span>)(inputs)
<span style="font-weight: bold; font-style: italic;">x</span> = tf.keras.layers.Dense(64, activation=<span style="color: #daa520; font-style: italic;">'relu'</span>)(x)
<span style="font-weight: bold; font-style: italic;">predictions</span> = tf.keras.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'softmax'</span>)(x)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20351;&#29992;&#36755;&#20837;&#21644;&#36755;&#20986;&#26469;&#26500;&#24314;&#27169;&#22411;&#23545;&#35937;</span>
<span style="font-weight: bold; font-style: italic;">model</span> = tf.keras.Model(inputs=inputs, outputs=predictions)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#37197;&#32622;&#35757;&#32451;&#36807;&#31243;</span>
model.<span style="font-weight: bold;">compile</span>(optimizer=tf.keras.optimizers.RMSProp(0.001),
              loss=tf.keras.losses.categorical_crossentropy,
              metrics=[<span style="color: #daa520; font-style: italic;">'accuracy'</span>])

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#35757;&#32451; 5 &#36718;</span>
model.fit(data, labels, batch_size=32, epochs=5)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">模型继承</h3>
<div class="outline-text-3" id="text-1-6">
<p>
除了上述两种模型构建方法，也可以通过继承<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model">tf.keras.Model</a>，实现前向传播方法来构建模
型。在 <code>__init__</code> 方法中创建网络层，然后设置为模型属性。然后在 <code>call</code> 方法中定义
前向传播。
</p>

<p>
模型继承构建模型的方法在采用<a href="https://www.tensorflow.org/guide/eager">eager execution</a>模式时非常有用。
</p>

<p>
如下为采取继承的方法构建一个全链接网络：
</p>
<div class="org-src-container">

<pre class="src src-pythond">class MyModel(tf.keras.Model):
    def __init__(self, num_classes=10):
	super(MyModel, self).__init__(name='my_model')
	self.num_classes = num_classes
	# 定义网络层
	self.dense_1 = tf.keras.layers.Dense(32, activation='relu')
	self.dense_2 = tf.keras.layers.Dense(num_classes, activation='sigmoid')

    def call(self, inputs):
	# 采取__init__中定义的网络层来定义前向传播
	x = self.dense_1(inputs)
	return self.dense_2(x)

    def compute_output_shape(self, input_shape):
	# 如果该模型需要作为函数模型的一部分，那么需要定义该方法
	shape = tf.TensorShape(input_shape).as_list()
	shape[-1] = self.num_classes
	return tf.TensorShape(shape)

    # 实例化模型
    model = MyModel(num_classes=10)
