notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.org
** 网络层适配
可以通过继承改写网络层 [[https://www.tensorflow.org/api_docs/python/tf/keras/layers/Layer][tf.keras.layers.Layer]] 来扩展模型构建能力，需要实现如下对
应方法：
+ =build= :: 通过调用 add_weight 来加载网络层权值。
+ =call= :: 定义前向传播。
+ =compute_output_shape= :: 通过输入的维度计算输出的维度。
+ =get_config= 和 =from_config= :: 可选，网络层序列化和反序列化方法。


如下为矩阵相乘的网络层适配：
#+BEGIN_SRC python
  class MyLayer(tf.keras.layers.Layer):
      def __init__(self, output_dim, **kwargs):
          self.output_dim = output_dim
          super(MyLayer, self).__init__(**kwargs)

      def build(self, input_shape):
          shape = tf.TensorShape((input_shape[1], self.output_dim))
          # 创建可训练的权值参数
          self.kernel = self.add_weight(name='kernel',
                                        shape=shape,
                                        initializer='uniform',
                                        trainable=True)
          # 该方法在最后调用
          super(MyLayer, self).build(input_shape)

      def call(self, inputs):
          return tf.matmul(inputs, self.kernel)

      def compute_output_shape(self, input_shape):
          shape = tf.TensorShape(input_shape).as_list()
          shape[-1] = self.output_dim
          return tf.TensorShape(shape)

      def get_config(self):
          base_config = super(MyLayer, self).get_config()
          base_config['output_dim'] = self.output_dim
          return base_config

      @classmethod
      def from_config(cls, config):
          return cls(**config)

  model = tf.keras.Sequential([MyLayer(10),
                               tf.keras.layers.Activation('softmax')])
#+END_SRC

** 回调方法
回调方法可以用来对训练过程增加额外的功能。可以自己实现回调对象，或者直接调用
[[https://www.tensorflow.org/api_docs/python/tf/keras/callbacks][tf.keras.callbacks]]模块中预先定义的回调方法：
+ *[[https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/ModelCheckpoint][tf.keras.callbacks.ModelCheckpoint]]* :: 模型 checkpoint 配置和实现。
+ *[[https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/LearningRateScheduler][tf.keras.callbacks.LearningRateScheduler]]* :: 训练过程中动态修改学习率。
+ *[[https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/EarlyStopping][tf.keras.callbacks.EarlyStopping]]* :: 验证集上性能不再提升后，快速停止训练过程。
+ *[[https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/TensorBoard][tf.keras.callbacks.TensorBoard]]* :: 采用[[https://www.tensorflow.org/guide/summaries_and_tensorboard][TensorBoard]]来监控训练中指标


需要将对应的 callback 对象传入 fit 方法中：
#+BEGIN_SRC python
  callbacks = [
      # 如何验证集 loss 经过 2 轮训练不再降低，那么就停止训练流程
      tf.keras.callbacks.EarlyStopping(patience=2, monitor='val_loss'),
      # 打开 TensorBoard 监控
      tf.keras.callbacks.TensorBoard(log_dir='./logs')
  ]

  model.fit(data, labels, batch_size=32, epochs=5, callbacks=callbacks,
            validation_data=(val_data, val_targets))
#+END_SRC

** 模型的保存和加载
*** 权值保存
调用[[https://www.tensorflow.org/api_docs/python/tf/keras/Model#save_weights][tf.keras.Model.save_weights]]保存模型的权值：
#+BEGIN_SRC python
  # 保存模型的权值
  model.save_weights("./my_model")

  # 加载模型权值，需要模型和保存时候具有相同的网络结构
  model.load_weights("my_model")
#+END_SRC

默认，tf.keras 保存的模型权值格式为诶[[https://www.tensorflow.org/guide/checkpoints][TensorFlow checkpoint]]，也可以采取 =Keras
HDF5= 格式，该格式为 Keras 默认的支持更多后端机器学习框架保存格式。
#+BEGIN_SRC python
  # 保存为 HDF5 格式
  model.save_weights("my_model.h5", save_format='h5')

  # 加载模型
  model.load_weights("my_model.h5")
#+END_SRC

*** 配置保存
模型的配置信息也可以保存，即模型的网络结构，但是不包括权重值。可以直接通过保存的
模型配置信息构建和初始化一个网络模型。Keras 支持 JSON 和 YAML 作为序列化格式：
#+BEGIN_SRC python
  # 序列化模型到 json
  json_string = model.to_json()

  # 从 json 加载模型
  fresh_model = tf.keras.models.from_json(json_string)

  # 序列化模型到 yaml
  yaml_string = model.to_yaml()

  # 从 yaml 加载模型
  fresh_model = tf.keras.models.from_yaml(yaml_string)
#+END_SRC

#+BEGIN_QUOTE
继承的模型无法序列化，因为模型的结构是 python 定义的。
#+END_QUOTE


