publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.html

    # 配置训练过程
    model.compile(optimizer=tf.keras.optimizers.RMSProp(0.001),
		  loss=tf.keras.categorical_crossentropy,
		  metrics=['accuracy'])

    # 训练 5 轮
    model.fit(data, labels, batch_size=32, epochs=5)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">网络层适配</h3>
<div class="outline-text-3" id="text-1-7">
<p>
可以通过继承改写网络层 <a href="https://www.tensorflow.org/api_docs/python/tf/keras/layers/Layer">tf.keras.layers.Layer</a> 来扩展模型构建能力，需要实现如下对
应方法：
</p>
<dl class="org-dl">
<dt> <code>build</code> </dt><dd>通过调用 add_weight 来加载网络层权值。
</dd>
<dt> <code>call</code> </dt><dd>定义前向传播。
</dd>
<dt> <code>compute_output_shape</code> </dt><dd>通过输入的维度计算输出的维度。
</dd>
<dt> <code>get_config</code> 和 <code>from_config</code> </dt><dd>可选，网络层序列化和反序列化方法。
</dd>
</dl>


<p>
如下为矩阵相乘的网络层适配：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MyLayer</span>(tf.keras.layers.Layer):
    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, output_dim, **kwargs):
        <span style="color: #00bfff; font-weight: bold;">self</span>.output_dim = output_dim
        <span style="font-weight: bold;">super</span>(MyLayer, <span style="color: #00bfff; font-weight: bold;">self</span>).__init__(**kwargs)

    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">build</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, input_shape):
        <span style="font-weight: bold; font-style: italic;">shape</span> = tf.TensorShape((input_shape[1], <span style="color: #00bfff; font-weight: bold;">self</span>.output_dim))
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21019;&#24314;&#21487;&#35757;&#32451;&#30340;&#26435;&#20540;&#21442;&#25968;</span>
        <span style="color: #00bfff; font-weight: bold;">self</span>.kernel = <span style="color: #00bfff; font-weight: bold;">self</span>.add_weight(name=<span style="color: #daa520; font-style: italic;">'kernel'</span>,
                                      shape=shape,
                                      initializer=<span style="color: #daa520; font-style: italic;">'uniform'</span>,
                                      trainable=<span style="font-weight: bold; text-decoration: underline;">True</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#35813;&#26041;&#27861;&#22312;&#26368;&#21518;&#35843;&#29992;</span>
        <span style="font-weight: bold;">super</span>(MyLayer, <span style="color: #00bfff; font-weight: bold;">self</span>).build(input_shape)

    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">call</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, inputs):
        <span style="color: #00bfff; font-weight: bold;">return</span> tf.matmul(inputs, <span style="color: #00bfff; font-weight: bold;">self</span>.kernel)

    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">compute_output_shape</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, input_shape):
        <span style="font-weight: bold; font-style: italic;">shape</span> = tf.TensorShape(input_shape).as_list()
        <span style="font-weight: bold; font-style: italic;">shape</span>[-1] = <span style="color: #00bfff; font-weight: bold;">self</span>.output_dim
        <span style="color: #00bfff; font-weight: bold;">return</span> tf.TensorShape(shape)

    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">get_config</span>(<span style="color: #00bfff; font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">base_config</span> = <span style="font-weight: bold;">super</span>(MyLayer, <span style="color: #00bfff; font-weight: bold;">self</span>).get_config()
        <span style="font-weight: bold; font-style: italic;">base_config</span>[<span style="color: #daa520; font-style: italic;">'output_dim'</span>] = <span style="color: #00bfff; font-weight: bold;">self</span>.output_dim
        <span style="color: #00bfff; font-weight: bold;">return</span> base_config

    <span style="font-weight: bold; text-decoration: underline;">@classmethod</span>
    <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">from_config</span>(cls, config):
        <span style="color: #00bfff; font-weight: bold;">return</span> cls(**config)

<span style="font-weight: bold; font-style: italic;">model</span> = tf.keras.Sequential([MyLayer(10),
                             tf.keras.layers.Activation(<span style="color: #daa520; font-style: italic;">'softmax'</span>)])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">回调方法</h3>
<div class="outline-text-3" id="text-1-8">
<p>
回调方法可以用来对训练过程增加额外的功能。可以自己实现回调对象，或者直接调用
<a href="https://www.tensorflow.org/api_docs/python/tf/keras/callbacks">tf.keras.callbacks</a>模块中预先定义的回调方法：
</p>
<dl class="org-dl">
<dt> <b><a href="https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/ModelCheckpoint">tf.keras.callbacks.ModelCheckpoint</a></b> </dt><dd>模型 checkpoint 配置和实现。
</dd>
<dt> <b><a href="https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/LearningRateScheduler">tf.keras.callbacks.LearningRateScheduler</a></b> </dt><dd>训练过程中动态修改学习率。
</dd>
<dt> <b><a href="https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/EarlyStopping">tf.keras.callbacks.EarlyStopping</a></b> </dt><dd>验证集上性能不再提升后，快速停止训练过程。
</dd>
<dt> <b><a href="https://www.tensorflow.org/api_docs/python/tf/keras/callbacks/TensorBoard">tf.keras.callbacks.TensorBoard</a></b> </dt><dd>采用<a href="https://www.tensorflow.org/guide/summaries_and_tensorboard">TensorBoard</a>来监控训练中指标
</dd>
</dl>


<p>
需要将对应的 callback 对象传入 fit 方法中：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">callbacks</span> = [
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#22914;&#20309;&#39564;&#35777;&#38598; loss &#32463;&#36807; 2 &#36718;&#35757;&#32451;&#19981;&#20877;&#38477;&#20302;&#65292;&#37027;&#20040;&#23601;&#20572;&#27490;&#35757;&#32451;&#27969;&#31243;</span>
    tf.keras.callbacks.EarlyStopping(patience=2, monitor=<span style="color: #daa520; font-style: italic;">'val_loss'</span>),
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25171;&#24320; TensorBoard &#30417;&#25511;</span>
    tf.keras.callbacks.TensorBoard(log_dir=<span style="color: #daa520; font-style: italic;">'./logs'</span>)
]

model.fit(data, labels, batch_size=32, epochs=5, callbacks=callbacks,
          validation_data=(val_data, val_targets))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">模型的保存和加载</h3>
<div class="outline-text-3" id="text-1-9">
</div><ul class="org-ul"><li><a id="sec-1-9-1" name="sec-1-9-1"></a>权值保存<br  /><div class="outline-text-4" id="text-1-9-1">
<p>
调用<a href="https://www.tensorflow.org/api_docs/python/tf/keras/Model#save_weights">tf.keras.Model.save_weights</a>保存模型的权值：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20445;&#23384;&#27169;&#22411;&#30340;&#26435;&#20540;</span>
model.save_weights(<span style="color: #daa520; font-style: italic;">"./my_model"</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21152;&#36733;&#27169;&#22411;&#26435;&#20540;&#65292;&#38656;&#35201;&#27169;&#22411;&#21644;&#20445;&#23384;&#26102;&#20505;&#20855;&#26377;&#30456;&#21516;&#30340;&#32593;&#32476;&#32467;&#26500;</span>
model.load_weights(<span style="color: #daa520; font-style: italic;">"my_model"</span>)
</pre>
</div>

<p>
默认，tf.keras 保存的模型权值格式为诶<a href="https://www.tensorflow.org/guide/checkpoints">TensorFlow checkpoint</a>，也可以采取 <code>Keras
HDF5</code> 格式，该格式为 Keras 默认的支持更多后端机器学习框架保存格式。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20445;&#23384;&#20026; HDF5 &#26684;&#24335;</span>
model.save_weights(<span style="color: #daa520; font-style: italic;">"my_model.h5"</span>, save_format=<span style="color: #daa520; font-style: italic;">'h5'</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21152;&#36733;&#27169;&#22411;</span>
model.load_weights(<span style="color: #daa520; font-style: italic;">"my_model.h5"</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-9-2" name="sec-1-9-2"></a>配置保存<br  /><div class="outline-text-4" id="text-1-9-2">
<p>
模型的配置信息也可以保存，即模型的网络结构，但是不包括权重值。可以直接通过保存的
模型配置信息构建和初始化一个网络模型。Keras 支持 JSON 和 YAML 作为序列化格式：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#24207;&#21015;&#21270;&#27169;&#22411;&#21040; json</span>
<span style="font-weight: bold; font-style: italic;">json_string</span> = model.to_json()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20174; json &#21152;&#36733;&#27169;&#22411;</span>
<span style="font-weight: bold; font-style: italic;">fresh_model</span> = tf.keras.models.from_json(json_string)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#24207;&#21015;&#21270;&#27169;&#22411;&#21040; yaml</span>
<span style="font-weight: bold; font-style: italic;">yaml_string</span> = model.to_yaml()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20174; yaml &#21152;&#36733;&#27169;&#22411;</span>
<span style="font-weight: bold; font-style: italic;">fresh_model</span> = tf.keras.models.from_yaml(yaml_string)
</pre>
</div>

<blockquote>
<p>
继承的模型无法序列化，因为模型的结构是 python 定义的。
</p>
</blockquote>
</div>
</li>
