notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.org
*** 保存整个模型
整个模型包括模型的配置，即模型的网络结构；模型的权重值；甚至优化算法的配置信息组
成。保存整个模型，可以使得训练中保存单个的 checkpoint，随后恢复训练流程。

#+BEGIN_SRC python
  # 创建模型
  model = tf.keras.Sequential([
      tf.keras.layers.Dense(10, activation='softmax', input_shape=(32,)),
      tf.keras.layers.Dense(10, activation='sfotmax')
  ])

  model.compile(optimizer='rmsprop',
                loss='categorical_crossentropy',
                metrics=['accuracy'])

  model.fit(data, targets, batch_size=32, epochs=5)

  # 保存模型
  model.save("my_model.h5")

  # 加载模型，包括权值和网络结构，优化算法
  model = tf.keras.models.load_model("my_model.h5")
#+END_SRC

** 立即执行模式
[[https://www.tensorflow.org/guide/eager][Eager execution]] 提供了交互式命令编程环境，使得 tensorflow 可以立即执行对应的操作。

=tf.keras= 的所有模型构建 API 都支持立即执行模式。

具体可以参考[[https://www.tensorflow.org/guide/eager][eager execution]]。

** 分布式

*** Estimators
[[https://www.tensorflow.org/guide/estimators][Estimator]] API 接口可以用来进行模型的分布式训练。

=tf.keras.Model= 需要转换为 =tf.estimator.Estimator= 模型后，可以依托
=tf.estimator= 训练接口实现分布式训练。转换方法为
=tf.estimator.model_to_estimator= ，具体可以参考 [[https://www.tensorflow.org/guide/estimators#creating_estimators_from_keras_models][Creating Estimator from Keras
Models]] 。

#+BEGIN_SRC python
  model = keras.Sequential([tf.layers.Dense(10, activation='softmax'),
                            tf.layers.Dense(10, activation='softmax')])

  model.compile(optimizer=tf.keras.optimizers.RMSProp(0.001),
                loss=tf.keras.lossses.categorical_crossentropy,
                metrics=['accuracy'])

  estimator = keras.estimator.model_to_estimator(model)
#+END_SRC

*** Multiple GPU
tf.keras 模型可以使用 [[https://www.tensorflow.org/api_docs/python/tf/contrib/distribute/DistributionStrategy][tf.contrib.distribute.DistributionStrategy]] 在多 GPU 上进行分
布式训练，并且基本不需要更改任何代码。

现阶段，分布式策略只支持[[https://www.tensorflow.org/api_docs/python/tf/contrib/distribute/MirroredStrategy][ tf.contrib.distribute.MirroredStrategy]] 。
*MirroredStrategy* 会对整个网络结构进行复制，然后单机上执行 all-reduce 的同步训
练。

如下为 tf.keras.Model 在单机多 GPU 上训练的例子。

首先定义模型：
#+BEGIN_SRC python
  model=tf.keras.Sequential()
  model.add(tf.keras.layers.Dense(16, activationo='relu', input_shape=(10, )))
  model.add(tf.keras.layers.Dense(1, activation='sigmoid'))

  optimizer = tf.train.GradientDescentOptimizer(0.2)

  model.compile(optimizer=optimizer, loss='binary_crossentropy')

  model.summary()
#+END_SRC

定义输入流， =input_fn= 返回 =tf.data.Dataset= 对象，用来将训练数据分发到不同的
GPU 上，每个 GPU 处理一部分输入数据：
#+BEGIN_SRC python
  def input_fn():
      x = np.random.random((1024, 10))
      y = np.random.randint(2, size=(1024, 1))
      x = tf.cast(x, tf.float32)
      dataset = tf.data.Dataset.from_tensor_slices((x, y))
      dataset = dataset.repeat(10)
      dataset = dataset.batch(32)
      return dataset

#+END_SRC

然后创建 =tf.estimator.RunConfig= 配置，并且设置 /train_distribute/ 参数为
=tf.contrib.distribute.MirroredStrategy= 。并且在创建 /MirroredStrategy/ 时，可
以指定 GPU 列表或者设置 /num_gpus/ 参数。默认为采取所有的 GPU：
#+BEGIN_SRC python
  strategy = tf.contrib.distribute.MirroredStrategy()
  config = tf.estimator.RunConfig(train_strategy=strategy)
#+END_SRC

将 Keras 模型转换为 Estimator:
#+BEGIN_SRC python
  keras_estimator = tf.keras.estimator.model_to_estimator(
      keras_model=mdoel,
      config=config,
      model_dir='/tmp/model_dir')
#+END_SRC

最后调用 Estimator 对应的 /train/ 方法进行训练：
#+BEGIN_SRC python
  keras_estimator.train(input_fn=input_fn, steps=10)
#+END_SRC
