publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/keras.html


<li><a id="sec-1-9-3" name="sec-1-9-3"></a>保存整个模型<br  /><div class="outline-text-4" id="text-1-9-3">
<p>
整个模型包括模型的配置，即模型的网络结构；模型的权重值；甚至优化算法的配置信息组
成。保存整个模型，可以使得训练中保存单个的 checkpoint，随后恢复训练流程。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21019;&#24314;&#27169;&#22411;</span>
<span style="font-weight: bold; font-style: italic;">model</span> = tf.keras.Sequential([
    tf.keras.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'softmax'</span>, input_shape=(32,)),
    tf.keras.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'sfotmax'</span>)
])

model.<span style="font-weight: bold;">compile</span>(optimizer=<span style="color: #daa520; font-style: italic;">'rmsprop'</span>,
              loss=<span style="color: #daa520; font-style: italic;">'categorical_crossentropy'</span>,
              metrics=[<span style="color: #daa520; font-style: italic;">'accuracy'</span>])

model.fit(data, targets, batch_size=32, epochs=5)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20445;&#23384;&#27169;&#22411;</span>
model.save(<span style="color: #daa520; font-style: italic;">"my_model.h5"</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21152;&#36733;&#27169;&#22411;&#65292;&#21253;&#25324;&#26435;&#20540;&#21644;&#32593;&#32476;&#32467;&#26500;&#65292;&#20248;&#21270;&#31639;&#27861;</span>
<span style="font-weight: bold; font-style: italic;">model</span> = tf.keras.models.load_model(<span style="color: #daa520; font-style: italic;">"my_model.h5"</span>)
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">立即执行模式</h3>
<div class="outline-text-3" id="text-1-10">
<p>
<a href="https://www.tensorflow.org/guide/eager">Eager execution</a> 提供了交互式命令编程环境，使得 tensorflow 可以立即执行对应的操作。
</p>

<p>
<code>tf.keras</code> 的所有模型构建 API 都支持立即执行模式。
</p>

<p>
具体可以参考<a href="https://www.tensorflow.org/guide/eager">eager execution</a>。
</p>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">分布式</h3>
<div class="outline-text-3" id="text-1-11">
</div><ul class="org-ul"><li><a id="sec-1-11-1" name="sec-1-11-1"></a>Estimators<br  /><div class="outline-text-4" id="text-1-11-1">
<p>
<a href="https://www.tensorflow.org/guide/estimators">Estimator</a> API 接口可以用来进行模型的分布式训练。
</p>

<p>
<code>tf.keras.Model</code> 需要转换为 <code>tf.estimator.Estimator</code> 模型后，可以依托
<code>tf.estimator</code> 训练接口实现分布式训练。转换方法为
<code>tf.estimator.model_to_estimator</code> ，具体可以参考 <a href="https://www.tensorflow.org/guide/estimators#creating_estimators_from_keras_models">Creating Estimator from Keras
Models</a> 。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">model</span> = keras.Sequential([tf.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'softmax'</span>),
                          tf.layers.Dense(10, activation=<span style="color: #daa520; font-style: italic;">'softmax'</span>)])

model.<span style="font-weight: bold;">compile</span>(optimizer=tf.keras.optimizers.RMSProp(0.001),
              loss=tf.keras.lossses.categorical_crossentropy,
              metrics=[<span style="color: #daa520; font-style: italic;">'accuracy'</span>])

<span style="font-weight: bold; font-style: italic;">estimator</span> = keras.estimator.model_to_estimator(model)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-11-2" name="sec-1-11-2"></a>Multiple GPU<br  /><div class="outline-text-4" id="text-1-11-2">
<p>
tf.keras 模型可以使用 <a href="https://www.tensorflow.org/api_docs/python/tf/contrib/distribute/DistributionStrategy">tf.contrib.distribute.DistributionStrategy</a> 在多 GPU 上进行分
布式训练，并且基本不需要更改任何代码。
</p>

<p>
现阶段，分布式策略只支持<a href="https://www.tensorflow.org/api_docs/python/tf/contrib/distribute/MirroredStrategy"> tf.contrib.distribute.MirroredStrategy</a> 。
<b>MirroredStrategy</b> 会对整个网络结构进行复制，然后单机上执行 all-reduce 的同步训
练。
</p>

<p>
如下为 tf.keras.Model 在单机多 GPU 上训练的例子。
</p>

<p>
首先定义模型：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">model</span>=tf.keras.Sequential()
model.add(tf.keras.layers.Dense(16, activationo=<span style="color: #daa520; font-style: italic;">'relu'</span>, input_shape=(10, )))
model.add(tf.keras.layers.Dense(1, activation=<span style="color: #daa520; font-style: italic;">'sigmoid'</span>))

<span style="font-weight: bold; font-style: italic;">optimizer</span> = tf.train.GradientDescentOptimizer(0.2)

model.<span style="font-weight: bold;">compile</span>(optimizer=optimizer, loss=<span style="color: #daa520; font-style: italic;">'binary_crossentropy'</span>)

model.summary()
</pre>
</div>

<p>
定义输入流， <code>input_fn</code> 返回 <code>tf.data.Dataset</code> 对象，用来将训练数据分发到不同的
GPU 上，每个 GPU 处理一部分输入数据：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">input_fn</span>():
    <span style="font-weight: bold; font-style: italic;">x</span> = np.random.random((1024, 10))
    <span style="font-weight: bold; font-style: italic;">y</span> = np.random.randint(2, size=(1024, 1))
    <span style="font-weight: bold; font-style: italic;">x</span> = tf.cast(x, tf.float32)
    <span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((x, y))
    <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat(10)
    <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
    <span style="color: #00bfff; font-weight: bold;">return</span> dataset
</pre>
</div>

<p>
然后创建 <code>tf.estimator.RunConfig</code> 配置，并且设置 <i>train_distribute</i> 参数为
<code>tf.contrib.distribute.MirroredStrategy</code> 。并且在创建 <i>MirroredStrategy</i> 时，可
以指定 GPU 列表或者设置 <i>num_gpus</i> 参数。默认为采取所有的 GPU：
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">strategy</span> = tf.contrib.distribute.MirroredStrategy()
<span style="font-weight: bold; font-style: italic;">config</span> = tf.estimator.RunConfig(train_strategy=strategy)
</pre>
</div>

<p>
将 Keras 模型转换为 Estimator:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">keras_estimator</span> = tf.keras.estimator.model_to_estimator(
    keras_model=mdoel,
    config=config,
    model_dir=<span style="color: #daa520; font-style: italic;">'/tmp/model_dir'</span>)
</pre>
</div>

<p>
最后调用 Estimator 对应的 <i>train</i> 方法进行训练：
</p>
<div class="org-src-container">

<pre class="src src-python">keras_estimator.train(input_fn=input_fn, steps=10)
</pre>
</div>
</div>
</li></ul>
</div>
</div>
</div>
</body>
</html>
